---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.InvalidRailProfile
source: html/a9cdf071-aac5-7ae3-0a97-bb818d53fd59.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.InvalidRailProfile Property

Profiles for one or more of the Rails are invalid. Make sure that every used Profile is a closed series of non-intersecting Lines.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidRailProfile { get; }
```